***TITANIC QUIZ***

In [ ]:
# import numpy and pandas
import numpy as np
import pandas as pd
import math

In [ ]:
# import csv file
titanic = pd.read_csv('/content/train.csv')

In [ ]:
# titanic.groupby('Embarked')['Fare'].mean()

Embarked
C    59.954144
Q    13.276030
S    27.079812
Name: Fare, dtype: float64

In [ ]:
#titanic.info()

Q1. Extract the titles (Mr., Mrs., Miss, etc.) from the names of passengers. What is the most common title?

In [ ]:
# split on basis of spaces and extract just titles
titanic['title'] = titanic['Name'].str.split(' ').str[1]

# groupby and count
titanic.groupby('title')['PassengerId'].count().sort_values(ascending=False).head(1)

title
Mr.    502
Name: PassengerId, dtype: int64

In [ ]:
# titanic['title']

Q2. Count the number of unique ticket prefixes in the Ticket column. What is the most common ticket prefix?

In [ ]:
# using str.split
titanic['Ticket'].str.split(' ').str[0].value_counts().head(1)

Ticket
PC    60
Name: count, dtype: int64

Q3. Identify passengers with multiple cabins. What proportion of passengers had multiple cabins?

In [ ]:
# *** DOUBT : VISIT AGAIN ***

titanic['new_cabin'] = titanic['Cabin'].str.split(' ').str.len()
df = titanic[titanic['new_cabin'] > 1].count() # 24 passengers with multiple cabins
df.iloc[0]
# titanic['new_cabin']

# number of passengers:
num_pass = df.iloc[0]

# total passengers
total_pass = titanic['PassengerId'].count()

# proportion of passengers with multiple cabins:
print("The proportion of passengers with multiple cabins : ",(num_pass/total_pass))

The proportion of passengers with multiple cabins :  0.026936026936026935

Q4. Calculate the average fare paid by passengers from each embarkation point. What is the average fare from 'S' (Southampton)?

In [ ]:
titanic.groupby('Embarked')['Fare'].mean()

Embarked
C    59.954144
Q    13.276030
S    27.079812
Name: Fare, dtype: float64

In [ ]:
#titanic.info()

Q5. Check if any passengers have the same last name. What is the most common last name?

In [ ]:
titanic['last_name'] = titanic['Name'].str.split(' ').str[0]
titanic.groupby('last_name')['PassengerId'].count().sort_values(ascending=False).head(1)

last_name
Andersson,    9
Name: PassengerId, dtype: int64

In [ ]:
# titanic['Name']

Q6. Identify passengers with first names that start with 'A'. How many passengers have first names starting with 'A'?

In [ ]:
#  *** DOUBT : VISIT AGAIN ***

# extract first name using split
titanic['first_name'] = titanic['Name'].str.split(' ').str[2]

titanic['first_name_letter'] = titanic['first_name'].apply(lambda x : x[1] if (x[0]=='(' or x[0]=='"') else x[0])

ans = titanic[titanic['first_name_letter']=='A'].count().iloc[0]

print(ans)

93

In [ ]:
# titanic.groupby('Survived')['PassengerId'].count()

Q7. Calculate the proportion of passengers who survived based on their title. What is the avg survival rate for passengers with the title 'Mr'?

In [ ]:
# proportion of passengers who survived based on their title
titanic[titanic['Survived'] == 1].groupby('title')['Survived'].count().sort_values(ascending=False)

title
Miss.           126
Mrs.             97
Mr.              79
Master.          23
Dr.               3
y                 3
Gordon,           2
Mlle.             2
Col.              1
Major.            1
Messemaeker,      1
Mme.              1
Ms.               1
Mulder,           1
the               1
Name: Survived, dtype: int64

In [ ]:
# What is the avg survival rate for passengers with the title 'Mr'?

# survived passengers with title == 'Mr'  hint: extracting survival based on title into new dataframe
new_df = titanic[titanic['Survived']==1].groupby('title')['Survived'].count().sort_values(ascending=False)
sur_Mr = new_df.loc['Mr.']
total_Mr = titanic[titanic['title']=='Mr.'].count().iloc[0]

print('Avg survival rate for passengers with the title Mister : ',sur_Mr/total_Mr)

Avg survival rate for passengers with the title Mister :  0.15737051792828685

Q8. Find the most frequent first letter of passengers' last names. What is the most common first letter?

In [ ]:
# most frequent first letter of passengers' last names
titanic['last_name'].str[0].value_counts().head()

last_name
S    86
M    74
B    72
H    69
C    69
Name: count, dtype: int64

In [ ]:
# What is the most common first letter?
titanic['last_name'].str[0].value_counts().head(1)

last_name
S    86
Name: count, dtype: int64

Q9. Create a new column 'FamilySize' based on the number of siblings/spouses[SibSp] and parents/children['Parch'] aboard. What is the average family size?

In [ ]:
# Family Size = addition of siblings + spouses + parents + children of passenger and passenger himself/herself.

titanic['FamilySize'] = titanic['SibSp'] + titanic['Parch'] + 1

In [ ]:
# What is the average family size?

titanic['FamilySize'].mean()

1.904601571268238

Q10. Find the most common cabin deck based on the Cabin column. Which deck is the most common?

In [ ]:
# titanic.groupby('Cabin')['PassengerId'].count().sort_values(ascending=False)
titanic['cabin_group'] = titanic['Cabin'].str[0]
titanic.groupby('cabin_group')['PassengerId'].count().sort_values(ascending=False)

cabin_group
C    59
B    47
D    33
E    32
A    15
F    13
G     4
T     1
Name: PassengerId, dtype: int64